Nombre:

---




# Clase 2 - Estructuras de datos en python

Fundamentos de dirección financiera para el análisis de datos.

# Configuración e ingesta de datos

In [1]:
import pandas as pd
import numpy as np

Sube los dos archivos:
- database.csv
- PRIME.csv

a la carpeta de archivos de Google Collab para poder utilizarlos durante la sesión.

Para comenzar, lee el archivo *database.csv* a un objeto, data.

In [2]:
data = pd.read_csv('/Users/nimi/Github Repository/primero/data/database.csv')
print(data.shape)
display(data.head())
print("-"*40)
display(data.tail())
print(data.tail)

(5413, 20)

,Institution Name,Main Office,Branch Name,Branch Number,Established Date,Acquired Date,Street Address,City,County,State,Zipcode,Latitude,Longitude,2010 Deposits,2011 Deposits,2012 Deposits,2013 Deposits,2014 Deposits,2015 Deposits,2016 Deposits
0,JPMorgan Chase Bank,1,JPMorgan Chase Bank Main Office,0,01/01/1824,NaN,1111 Polaris Parkway,Columbus,Delaware,OH,43240,40.14453,-82.99115,633131000.0,743268000.0,832455000.0,916543000.0,1.032549e+09,1.069425e+09,1155185000
1,JPMorgan Chase Bank,0,Vernon Hills Scarsdale Branch,2,03/20/1961,NaN,676 White Plains Road,Scarsdale,Westchester,NY,10583,40.97008,-73.80670,293229.0,310791.0,325742.0,327930.0,3.277920e+05,3.414750e+05,381558
2,JPMorgan Chase Bank,0,Great Neck Northern Boulevard Branch,3,09/09/1963,NaN,410 Northern Boulevard,Great Neck,Nassau,NY,11021,40.77944,-73.72240,191011.0,206933.0,216439.0,237983.0,2.341830e+05,2.624550e+05,278940
3,JPMorgan Chase Bank,0,North Hartsdale Branch,4,02/19/1966,NaN,353 North Central Avenue,Hartsdale,Westchester,NY,10530,41.02654,-73.79168,87110.0,88367.0,93163.0,109659.0,1.119850e+05,1.167720e+05,140233
4,JPMorgan Chase Bank,0,Lawrence Rockaway Branch,5,01/16/1965,NaN,335 Rockaway Turnpike,Lawrence,Nassau,NY,11559,40.62715,-73.73675,172608.0,172749.0,189413.0,198445.0,2.051980e+05,2.232000e+05,235594

----------------------------------------

,Institution Name,Main Office,Branch Name,Branch Number,Established Date,Acquired Date,Street Address,City,County,State,Zipcode,Latitude,Longitude,2010 Deposits,2011 Deposits,2012 Deposits,2013 Deposits,2014 Deposits,2015 Deposits,2016 Deposits
5408,JPMorgan Chase Bank,0,Alameda and Compton Blvd Branch,7981,11/03/2015,NaN,251 E Compton Blvd,Compton,Los Angeles,CA,90220,33.89601,-118.22084,NaN,NaN,NaN,NaN,NaN,NaN,3446
5409,JPMorgan Chase Bank,0,Charleston and Rancho,7982,02/02/2016,NaN,2311 W Chafrleston Blvd,Las Vegas,Clark,NV,89102,36.14270,-115.19043,NaN,NaN,NaN,NaN,NaN,NaN,2666
5410,JPMorgan Chase Bank,0,Los Olivos Branch,7984,03/15/2016,NaN,8593 Irvine Center Drive,Irvine,Orange,CA,92618,33.64412,-117.74453,NaN,NaN,NaN,NaN,NaN,NaN,6689
5411,JPMorgan Chase Bank,0,Lake Forest Branch,7988,01/01/2016,NaN,5660 Read Blvd,New Orleans,Orleans,LA,70127,30.03205,-89.97260,NaN,NaN,NaN,NaN,NaN,NaN,94133
5412,JPMorgan Chase Bank,0,Buffalo-Mm Branch,7989,01/01/2016,NaN,350 Main Street,Buffalo,Erie,NY,14202,42.88429,-78.87487,NaN,NaN,NaN,NaN,NaN,NaN,45596

<bound method NDFrame.tail of          Institution Name  Main Office                           Branch Name  \
0     JPMorgan Chase Bank            1       JPMorgan Chase Bank Main Office
1     JPMorgan Chase Bank            0         Vernon Hills Scarsdale Branch
2     JPMorgan Chase Bank            0  Great Neck Northern Boulevard Branch
3     JPMorgan Chase Bank            0                North Hartsdale Branch
4     JPMorgan Chase Bank            0              Lawrence Rockaway Branch
...                   ...          ...                                   ...
5408  JPMorgan Chase Bank            0       Alameda and Compton Blvd Branch
5409  JPMorgan Chase Bank            0                 Charleston and Rancho
5410  JPMorgan Chase Bank            0                     Los Olivos Branch
5411  JPMorgan Chase Bank            0                    Lake Forest Branch
5412  JPMorgan Chase Bank            0                     Buffalo-Mm Branch

      Branch Number Established Date Acquired Date            Street Address  \
0                 0       01/01/1824           NaN      1111 Polaris Parkway
1                 2       03/20/1961           NaN     676 White Plains Road
2                 3       09/09/1963           NaN    410 Northern Boulevard
3                 4       02/19/1966           NaN  353 North Central Avenue
4                 5       01/16/1965           NaN     335 Rockaway Turnpike
...             ...              ...           ...                       ...
5408           7981       11/03/2015           NaN        251 E Compton Blvd
5409           7982       02/02/2016           NaN   2311 W Chafrleston Blvd
5410           7984       03/15/2016           NaN  8593 Irvine Center Drive
5411           7988       01/01/2016           NaN            5660 Read Blvd
5412           7989       01/01/2016           NaN           350 Main Street

             City       County State  Zipcode  Latitude  Longitude  \
0        Columbus     Delaware    OH    43240  40.14453  -82.99115
1       Scarsdale  Westchester    NY    10583  40.97008  -73.80670
2      Great Neck       Nassau    NY    11021  40.77944  -73.72240
3       Hartsdale  Westchester    NY    10530  41.02654  -73.79168
4        Lawrence       Nassau    NY    11559  40.62715  -73.73675
...           ...          ...   ...      ...       ...        ...
5408      Compton  Los Angeles    CA    90220  33.89601 -118.22084
5409    Las Vegas        Clark    NV    89102  36.14270 -115.19043
5410       Irvine       Orange    CA    92618  33.64412 -117.74453
5411  New Orleans      Orleans    LA    70127  30.03205  -89.97260
5412      Buffalo         Erie    NY    14202  42.88429  -78.87487

      2010 Deposits  2011 Deposits  2012 Deposits  2013 Deposits  \
0       633131000.0    743268000.0    832455000.0    916543000.0
1          293229.0       310791.0       325742.0       327930.0
2          191011.0       206933.0       216439.0       237983.0
3           87110.0        88367.0        93163.0       109659.0
4          172608.0       172749.0       189413.0       198445.0
...             ...            ...            ...            ...
5408            NaN            NaN            NaN            NaN
5409            NaN            NaN            NaN            NaN
5410            NaN            NaN            NaN            NaN
5411            NaN            NaN            NaN            NaN
5412            NaN            NaN            NaN            NaN

      2014 Deposits  2015 Deposits  2016 Deposits
0      1.032549e+09   1.069425e+09     1155185000
1      3.277920e+05   3.414750e+05         381558
2      2.341830e+05   2.624550e+05         278940
3      1.119850e+05   1.167720e+05         140233
4      2.051980e+05   2.232000e+05         235594
...             ...            ...            ...
5408            NaN            NaN           3446
5409            NaN            NaN           2666
5410            NaN            NaN           6689
5411            NaN            NaN          94133
5412            NaN            NaN          45596

[5413 rows x 20 columns]>

# Ejercicio 1
- Identifica los tipos de cada columna
- Evalúa si son correctos o si habría que cambiar alguno, en caso de que haya algunos incorrectos guarda sus nombres en una lista

In [3]:
data.dtypes

Institution Name     object
Main Office           int64
Branch Name          object
Branch Number         int64
Established Date     object
Acquired Date        object
Street Address       object
City                 object
County               object
State                object
Zipcode               int64
Latitude            float64
Longitude           float64
2010 Deposits       float64
2011 Deposits       float64
2012 Deposits       float64
2013 Deposits       float64
2014 Deposits       float64
2015 Deposits       float64
2016 Deposits         int64
dtype: object

In [5]:
data.shape

(5413, 20)

Vamos a hacer listas

In [6]:
fechas = ['Established Date', 'Acquired Date']
decimales = ['2016 Deposits']
boolean = ['Main Office']
categories = ['Branch Number']
strings = ['Zipcode']

# Ejercicio 2
Utiliza astype para arreglar los tipos erróneos.

Muestra los tipos de las columnas resultantes de la transformación.

In [7]:
data[boolean] = data[boolean].astype(bool)
data[decimales] = data[decimales].astype(float)
data[categories] = data[categories].astype('category')
data[fechas] = data[fechas].astype('datetime64[ns]')
data[strings] = data[strings].astype(str)

data.dtypes

Institution Name            object
Main Office                   bool
Branch Name                 object
Branch Number             category
Established Date    datetime64[ns]
Acquired Date       datetime64[ns]
Street Address              object
City                        object
County                      object
State                       object
Zipcode                     object
Latitude                   float64
Longitude                  float64
2010 Deposits              float64
2011 Deposits              float64
2012 Deposits              float64
2013 Deposits              float64
2014 Deposits              float64
2015 Deposits              float64
2016 Deposits              float64
dtype: object

DUDA: puede ser que ZIPCODE funcione mejor siendo un string?

# Ejercicio 3

Utiliza el método describe para ver un resumen de los datos.

¿Faltan columnas? Eso ocurre porque, en caso de tener columnas con dtypes mixtos, el método describe solo evalúa aquellas de tipo numérico.

Selecciona las columnas basándote en sus tipos para describirlas.

Es importante tener los datos en la forma adecuada. Por ejemplo para el describe es solo para variables numericas

In [8]:
data.describe()

,Established Date,Acquired Date,Latitude,Longitude,2010 Deposits,2011 Deposits,2012 Deposits,2013 Deposits,2014 Deposits,2015 Deposits,2016 Deposits
count,5413,3798,5347.000000,5347.000000,4.673000e+03,4.835000e+03,5.084000e+03,5.238000e+03,5.357000e+03,5.394000e+03,5.413000e+03
mean,1978-05-08 15:12:12.237206752,2005-07-09 10:52:30.710900352,37.248922,-95.206261,2.668657e+05,3.037544e+05,3.234610e+05,3.462343e+05,3.819853e+05,3.935169e+05,4.268188e+05
min,1800-01-01 00:00:00,1975-01-18 00:00:00,0.000000,-124.421370,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,1962-03-23 00:00:00,2004-11-13 00:00:00,33.277225,-115.163740,2.252600e+04,2.315750e+04,2.465125e+04,2.689250e+04,2.935500e+04,3.394100e+04,3.951300e+04
50%,1989-04-30 00:00:00,2004-11-13 00:00:00,38.939520,-88.442410,4.307200e+04,4.442600e+04,4.717350e+04,5.041500e+04,5.450300e+04,6.013350e+04,6.815700e+04
75%,2006-10-26 00:00:00,2008-09-25 00:00:00,41.040635,-81.418135,8.502700e+04,8.614700e+04,9.000850e+04,9.506875e+04,1.023300e+05,1.115678e+05,1.243180e+05
max,2016-05-24 00:00:00,2011-10-14 00:00:00,48.844760,0.000000,6.331310e+08,7.432680e+08,8.324550e+08,9.165430e+08,1.032549e+09,1.069425e+09,1.155185e+09
std,NaN,NaN,5.430381,17.542081,9.568755e+06,1.110829e+07,1.211339e+07,1.312320e+07,1.461318e+07,1.507385e+07,1.632941e+07

In [9]:
data[['Zipcode']].describe()

       Zipcode
count     5413
unique    3550
top      10022
freq        11

In [10]:
data.select_dtypes(include='number').describe()

,Latitude,Longitude,2010 Deposits,2011 Deposits,2012 Deposits,2013 Deposits,2014 Deposits,2015 Deposits,2016 Deposits
count,5347.000000,5347.000000,4.673000e+03,4.835000e+03,5.084000e+03,5.238000e+03,5.357000e+03,5.394000e+03,5.413000e+03
mean,37.248922,-95.206261,2.668657e+05,3.037544e+05,3.234610e+05,3.462343e+05,3.819853e+05,3.935169e+05,4.268188e+05
std,5.430381,17.542081,9.568755e+06,1.110829e+07,1.211339e+07,1.312320e+07,1.461318e+07,1.507385e+07,1.632941e+07
min,0.000000,-124.421370,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,33.277225,-115.163740,2.252600e+04,2.315750e+04,2.465125e+04,2.689250e+04,2.935500e+04,3.394100e+04,3.951300e+04
50%,38.939520,-88.442410,4.307200e+04,4.442600e+04,4.717350e+04,5.041500e+04,5.450300e+04,6.013350e+04,6.815700e+04
75%,41.040635,-81.418135,8.502700e+04,8.614700e+04,9.000850e+04,9.506875e+04,1.023300e+05,1.115678e+05,1.243180e+05
max,48.844760,0.000000,6.331310e+08,7.432680e+08,8.324550e+08,9.165430e+08,1.032549e+09,1.069425e+09,1.155185e+09

In [11]:
data.select_dtypes(exclude='number').describe()

                    Established Date                  Acquired Date
count                           5413                           3798
mean   1978-05-08 15:12:12.237206752  2005-07-09 10:52:30.710900352
min              1800-01-01 00:00:00            1975-01-18 00:00:00
25%              1962-03-23 00:00:00            2004-11-13 00:00:00
50%              1989-04-30 00:00:00            2004-11-13 00:00:00
75%              2006-10-26 00:00:00            2008-09-25 00:00:00
max              2016-05-24 00:00:00            2011-10-14 00:00:00

# Ejercicio 4
Lee el archivo *PRIME.csv* y convierte las fechas según el formato de cada una usando pd.to_datetime

`NOTA: está separado con ';' `

In [12]:
prime = pd.read_csv('../data/PRIME.csv', sep=';')
prime.head()

     realtime_start realtime_end        date value
0  23 December 2019   2019-12-23   1/12/1947     .
1  23 December 2019   2019-12-23    1/8/1948     .
2  23 December 2019   2019-12-23   22/9/1950     .
3  23 December 2019   2019-12-23    8/1/1951     .
4  23 December 2019   2019-12-23  17/10/1951     .

In [13]:
prime.dtypes

realtime_start    object
realtime_end      object
date              object
value             object
dtype: object

In [14]:
prime['realtime_start'] = pd.to_datetime(prime['realtime_start'], format='%d %B %Y')
prime['realtime_end'] = pd.to_datetime(prime['realtime_end'], format='%Y-%m-%d')
prime['date'] = pd.to_datetime(prime['date'], format='%d/%m/%Y')

prime.head()

  realtime_start realtime_end       date value
0     2019-12-23   2019-12-23 1947-12-01     .
1     2019-12-23   2019-12-23 1948-08-01     .
2     2019-12-23   2019-12-23 1950-09-22     .
3     2019-12-23   2019-12-23 1951-01-08     .
4     2019-12-23   2019-12-23 1951-10-17     .

In [15]:
prime.dtypes

realtime_start    datetime64[ns]
realtime_end      datetime64[ns]
date              datetime64[ns]
value                     object
dtype: object

# Ejercicio 5
Extrae a objetos nuevos:
- El año de realtime_start
- El Q de realtime_end
- El día de la semana de date

Y descríbelos

In [28]:
# creame una funcion que sea una calculadora y multiplique por dos

In [16]:
year_start = prime['realtime_start'].dt.year
year_start.describe()

count     353.0
mean     2019.0
std         0.0
min      2019.0
25%      2019.0
50%      2019.0
75%      2019.0
max      2019.0
Name: realtime_start, dtype: float64

In [17]:
q_end = prime['realtime_end'].dt.quarter
q_end.describe()

count    353.0
mean       4.0
std        0.0
min        4.0
25%        4.0
50%        4.0
75%        4.0
max        4.0
Name: realtime_end, dtype: float64

In [18]:
weekday_date = prime['date'].dt.weekday
weekday_date.describe()

count    353.000000
mean       1.940510
std        1.465271
min        0.000000
25%        1.000000
50%        2.000000
75%        3.000000
max        6.000000
Name: date, dtype: float64

# Ejercicio 6

Calcula el plazo en días desde date a realtime end, y selecciona el máximo y el mínimo.

In [19]:
print((prime['realtime_end'] - prime['date']).max())
print((prime['realtime_end'] - prime['date']).min())

26320 days 00:00:00
53 days 00:00:00

# Ejercicio 7

En el conjunto de datos PRIME:
- Sustituye los ‘.’ por np.nan en la columna value
- Cuenta los missings usando isna + sum
- Elimina las filas con la columna value no informada

In [20]:
prime['value'] = prime['value'].replace({'.': np.nan})
prime['value'].isna().sum()

8

In [21]:
print(prime.shape)
prime.dropna(axis=0, inplace=True)
print(prime.shape)

(353, 4)
(345, 4)

# Ejercicio 8

En el conjunto de datos database:
- Saca el número de missings por columna
- Rellena a 0 los missings en las columnas del importe de los depósitos
- Rellena con la media los valores de latitud y longitud
- Deja missing la fecha de adquisición

In [25]:
data.isna().sum()

Institution Name       0
Main Office            0
Branch Name            0
Branch Number          0
Established Date       0
Acquired Date       1615
Street Address         0
City                   0
County                 0
State                  0
Zipcode                0
Latitude              66
Longitude             66
2010 Deposits          0
2011 Deposits          0
2012 Deposits          0
2013 Deposits          0
2014 Deposits          0
2015 Deposits          0
2016 Deposits          0
dtype: int64

In [33]:
nombres = [c for c in data.columns if 'Deposits' in c]
data[nombres] = data[nombres].fillna(0)
data.isna().sum()

Institution Name       0
Main Office            0
Branch Name            0
Branch Number          0
Established Date       0
Acquired Date       1615
Street Address         0
City                   0
County                 0
State                  0
Zipcode                0
Latitude              66
Longitude             66
2010 Deposits          0
2011 Deposits          0
2012 Deposits          0
2013 Deposits          0
2014 Deposits          0
2015 Deposits          0
2016 Deposits          0
dtype: int64

In [36]:
mean_lat = data['Latitude'].mean()
mean_long = data['Longitude'].mean()
print(mean_lat, mean_long)

data['Latitude'].fillna(mean_lat, inplace=True)
data['Longitude'].fillna(mean_lat, inplace=True)

data.isna().sum()

37.24892194314569 -95.20626091453151

/var/folders/wq/hqs95r295vxfkmvqpvydj4jm0000gn/T/ipykernel_4251/3351620158.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Latitude'].fillna(mean_lat, inplace=True)
/var/folders/wq/hqs95r295vxfkmvqpvydj4jm0000gn/T/ipykernel_4251/3351620158.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Longitude'].fillna(mean_lat, inplace=True)

Institution Name       0
Main Office            0
Branch Name            0
Branch Number          0
Established Date       0
Acquired Date       1615
Street Address         0
City                   0
County                 0
State                  0
Zipcode                0
Latitude               0
Longitude              0
2010 Deposits          0
2011 Deposits          0
2012 Deposits          0
2013 Deposits          0
2014 Deposits          0
2015 Deposits          0
2016 Deposits          0
dtype: int64

# Ejercicio 9

En el conjunto de datos database:
- Utiliza drop duplicates para quedarte solo con un registro por estado. Muestra el número de registros restante.
- Utiliza drop duplicates para quedarte solo con aquellos registros de ciudades en las que solo hay una oficina. Muestra el número de registros restante.

In [37]:
print(data.shape)
print(data.drop_duplicates(subset='State').shape)
print(data.drop_duplicates(subset=['City','County','State'], keep=False).shape[0])

(5413, 20)
(26, 20)
1226

# Ejercicio 10

Nos han mandado varios archivos de extracciones de la base de datos (se llaman database_i.xlsx donde i es un número de 1 a 6). Nos piden que creemos un solo conjunto de datos.

Únelos usando concatenate y respetando la lógica de los archivos.

In [41]:
pip install openpyxl

Collecting openpyxl
  Obtaining dependency information for openpyxl from https://files.pythonhosted.org/packages/6a/94/a59521de836ef0da54aaf50da6c4da8fb4072fb3053fa71f052fd9399e7a/openpyxl-3.1.2-py2.py3-none-any.whl.metadata
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Obtaining dependency information for et-xmlfile from https://files.pythonhosted.org/packages/96/c2/3dd434b0108730014f1b96fd286040dc3bcb70066346f7e01ec2ac95865f/et_xmlfile-1.1.0-py3-none-any.whl.metadata
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 8.7 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [42]:
dfs = {f'df{i}':pd.read_excel(f'../data/database_{i}.xlsx') for i in range(1,7)}
comp = pd.concat([pd.concat([dfs[f'df{i}'], dfs[f'df{i+1}']], axis=1) for i in range(1,7,2)], axis=0)
comp.shape

(5413, 20)

In [44]:
dfs = {}

for i in range(1,7):
  dfs[f'df{i}'] = pd.read_excel(f'../data/database_{i}.xlsx')
  print(dfs[f'df{i}'].shape)

tmp = []
for i in range(1,7,2):
  tmp.append(pd.concat([dfs[f'df{i}'], dfs[f'df{i+1}']], axis=1))

pd.concat(tmp, axis=0)

(1000, 3)
(1000, 17)
(1500, 5)
(1500, 15)
(2913, 10)
(2913, 10)

,Institution Name,Main Office,Branch Name,Branch Number,Established Date,Acquired Date,Street Address,City,County,State,Zipcode,Latitude,Longitude,2010 Deposits,2011 Deposits,2012 Deposits,2013 Deposits,2014 Deposits,2015 Deposits,2016 Deposits
0,JPMorgan Chase Bank,1,JPMorgan Chase Bank Main Office,0,01/01/1824,NaN,1111 Polaris Parkway,Columbus,Delaware,OH,43240,40.14453,-82.99115,633131000.0,743268000.0,832455000.0,916543000.0,1.032549e+09,1.069425e+09,1155185000
1,JPMorgan Chase Bank,0,Vernon Hills Scarsdale Branch,2,03/20/1961,NaN,676 White Plains Road,Scarsdale,Westchester,NY,10583,40.97008,-73.80670,293229.0,310791.0,325742.0,327930.0,3.277920e+05,3.414750e+05,381558
2,JPMorgan Chase Bank,0,Great Neck Northern Boulevard Branch,3,1963-09-09 00:00:00,NaN,410 Northern Boulevard,Great Neck,Nassau,NY,11021,40.77944,-73.72240,191011.0,206933.0,216439.0,237983.0,2.341830e+05,2.624550e+05,278940
3,JPMorgan Chase Bank,0,North Hartsdale Branch,4,02/19/1966,NaN,353 North Central Avenue,Hartsdale,Westchester,NY,10530,41.02654,-73.79168,87110.0,88367.0,93163.0,109659.0,1.119850e+05,1.167720e+05,140233
4,JPMorgan Chase Bank,0,Lawrence Rockaway Branch,5,01/16/1965,NaN,335 Rockaway Turnpike,Lawrence,Nassau,NY,11559,40.62715,-73.73675,172608.0,172749.0,189413.0,198445.0,2.051980e+05,2.232000e+05,235594
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2908,JPMorgan Chase Bank,0,Alameda and Compton Blvd Branch,7981,2015-03-11 00:00:00,NaN,251 E Compton Blvd,Compton,Los Angeles,CA,90220,33.89601,-118.22084,NaN,NaN,NaN,NaN,NaN,NaN,3446
2909,JPMorgan Chase Bank,0,Charleston and Rancho,7982,2016-02-02 00:00:00,NaN,2311 W Chafrleston Blvd,Las Vegas,Clark,NV,89102,36.14270,-115.19043,NaN,NaN,NaN,NaN,NaN,NaN,2666
2910,JPMorgan Chase Bank,0,Los Olivos Branch,7984,03/15/2016,NaN,8593 Irvine Center Drive,Irvine,Orange,CA,92618,33.64412,-117.74453,NaN,NaN,NaN,NaN,NaN,NaN,6689
2911,JPMorgan Chase Bank,0,Lake Forest Branch,7988,2016-01-01 00:00:00,NaN,5660 Read Blvd,New Orleans,Orleans,LA,70127,30.03205,-89.97260,NaN,NaN,NaN,NaN,NaN,NaN,94133
2912,JPMorgan Chase Bank,0,Buffalo-Mm Branch,7989,2016-01-01 00:00:00,NaN,350 Main Street,Buffalo,Erie,NY,14202,42.88429,-78.87487,NaN,NaN,NaN,NaN,NaN,NaN,45596

Si nos fijamos en las formas de los dataframes, vemos que van por parejas:
- El 2 es la parte derecha del 1
- El 3, la del 4
- El 5, la del 6

Así que lo primero es concatenarlos a lo ancho.

Luego tendremos que concatenarlos en vertical.

# Ejercicio 11

Ahora nos han mandado dos archivos, de diferentes épocas (2010-2013 en database_old.xlsx y 2014-2016 en database_new.xlsx). Combínalos para conseguir un conjunto de datos completos.

Después, añádele la información de cada oficina, que viene en office_info.xlsx.

In [46]:
old = pd.read_excel('../data/database_old.xlsx')
new = pd.read_excel('../data/database_new.xlsx')
info = pd.read_excel('../data/office_info.xlsx')

old.head(1), new.head(1), info.head(1)

(               Branch Name  Branch Number  2010 Deposits  2011 Deposits  \
 0  Washington, D.C. Branch           4409            0.0            0.0

    2012 Deposits  2013 Deposits
 0            0.0            0.0  ,
          Branch Name  Branch Number  2014 Deposits  2015 Deposits  \
 0  Radio City Branch           3763      1047649.0      1098648.0

    2016 Deposits
 0        1158172  ,
         Branch Name  Branch Number     Street Address       City       County  \
 0  Tarrytown Branch           3799  64 North Broadway  Tarrytown  Westchester

   State  Zipcode
 0    NY    10591  )

In [47]:
part = old.merge(new, on=['Branch Name', 'Branch Number'], how='outer')
part.head()

,Branch Name,Branch Number,2010 Deposits,2011 Deposits,2012 Deposits,2013 Deposits,2014 Deposits,2015 Deposits,2016 Deposits
0,1 30 and Broadway Branch,6689,7231.0,10962.0,14277.0,18811.0,22297.0,27113.0,32264
1,112th & Broadway Branch,5509,31362.0,43147.0,57269.0,68279.0,87942.0,106697.0,139455
2,12 Mile-Country Club Drive Branch,2837,87316.0,96703.0,107747.0,127349.0,142579.0,165378.0,168302
3,12335 Venice Blvd Branch,4738,100201.0,112127.0,114119.0,124824.0,145749.0,172413.0,175831
4,135th Street & Fifth Avenue Branch,784,52478.0,54744.0,57225.0,59578.0,59351.0,63149.0,67947

In [48]:
whole = part.merge(info, on=['Branch Number', 'Branch Name'], how='left')
whole.head()

,Branch Name,Branch Number,2010 Deposits,2011 Deposits,2012 Deposits,2013 Deposits,2014 Deposits,2015 Deposits,2016 Deposits,Street Address,City,County,State,Zipcode
0,1 30 and Broadway Branch,6689,7231.0,10962.0,14277.0,18811.0,22297.0,27113.0,32264,561 West Interstate 30,Garland,Dallas,TX,75043
1,112th & Broadway Branch,5509,31362.0,43147.0,57269.0,68279.0,87942.0,106697.0,139455,2875 Broadway,New York City,New York,NY,10025
2,12 Mile-Country Club Drive Branch,2837,87316.0,96703.0,107747.0,127349.0,142579.0,165378.0,168302,38601 West 12 Mile Road,Farmington Hills,Oakland,MI,48331
3,12335 Venice Blvd Branch,4738,100201.0,112127.0,114119.0,124824.0,145749.0,172413.0,175831,12335 Venice Blvd,Los Angeles,Los Angeles,CA,90066
4,135th Street & Fifth Avenue Branch,784,52478.0,54744.0,57225.0,59578.0,59351.0,63149.0,67947,2218 5th Avenue,New York City,New York,NY,10037